{"meta":{"title":"La Belle Aurore","subtitle":"my heart is in the work","description":"Always A Learner","author":"Lynn Liu","url":"http://yoursite.com"},"pages":[{"title":"About","date":"2018-06-06T00:30:01.000Z","updated":"2018-11-03T14:13:19.190Z","comments":false,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"Lynn(Shu) Liu CS Learner&amp;Lover CS &amp; STAT/Freshman/WISC 22’ Email: lynnliu113@gmail.com Personal Page: https://lynnliu030.github.io/ [Resume] Blog Info Built in 5/6/2018. Framework: hexo Theme: next"},{"title":"Categories","date":"2018-06-06T00:27:58.000Z","updated":"2018-06-05T19:20:40.168Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2018-06-06T00:29:22.000Z","updated":"2018-06-05T19:20:27.055Z","comments":false,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""},{"title":"Travel","date":"2018-06-07T02:34:42.000Z","updated":"2018-11-05T22:12:29.325Z","comments":true,"path":"travel/index.html","permalink":"http://yoursite.com/travel/index.html","excerpt":"","text":"Travelling and Taking Pictures EVERYWHERE! :)Haikou, Hainan, China2018Summer SuZhou/HangZhou, China New York City, New York, USA Madison, Wisconsin, USA"}],"posts":[{"title":"Leetcode Breif Summary and updated solutions","slug":"Leetcode-Solutions","date":"2018-11-05T17:57:59.000Z","updated":"2018-11-10T04:24:10.080Z","comments":true,"path":"2018/11/05/Leetcode-Solutions/","link":"","permalink":"http://yoursite.com/2018/11/05/Leetcode-Solutions/","excerpt":"A summary of leetcode submissions. Some of them are old submissions. Try to keep them up to date.","text":"A summary of leetcode submissions. Some of them are old submissions. Try to keep them up to date. IntroI started practicing doing some easy leetcode problems in 2018 summer. When I first started, without concerning about the time/space complexity, I came up with some … really stupid solutions. I record them here and I will review the problems &amp; solutions in the future. Q&amp;AQuestion 21: Merge two sorted ListQ: Merge two sorted linked lists and return it as a new list. The new list should be made by splicing together the nodes of the first two lists. Example:Input: 1-&gt;2-&gt;4, 1-&gt;3-&gt;4 Output: 1-&gt;1-&gt;2-&gt;3-&gt;4-&gt;4 My solution: (Old Submission)/** * Definition for singly-linked list. * public class ListNode { * int val; * ListNode next; * ListNode(int x) { val = x; } * } */ class Solution { public ListNode mergeTwoLists(ListNode l1, ListNode l2) { if(l1 == null) // If the l1 is null, simply return l2 return l2; if(l2 == null) // If the l2 is null, return l1 return l1; ListNode mergeList = new ListNode(0); // create a new listNode to store the merge list ListNode headerNode = mergeList; // create a headerNode to record the first position in the list while(l1 != null || l2 != null){ // iterate through l1 and l2 else if(l1.val &lt; l2.val || l2 == null){ mergeList.next = l1; mergeList = mergeList.next; l1 = l1.next; } else if(l1.val &gt;= l2.val || l1 == null){ mergeList.next = l2; mergeList = mergeList.next; l2 = l2.next; } } return headerNode.next; } } Question 26: Remove Duplicates from Sorted ArrayQ: Given a sorted array nums, remove the duplicates in-place such that each element appear only once and return the new length.Do not allocate extra space for another array, you must do this by modifying the input array in-place with O(1) extra memory.Example 1:Given nums = [1,1,2], Your function should return length = 2, with the first two elements of nums being 1 and 2 respectively. It doesn’t matter what you leave beyond the returned length.Example 2:Given nums = [0,0,1,1,1,2,2,3,3,4], Your function should return length = 5, with the first five elements of nums being modified to 0, 1, 2, 3, and 4 respectively. It doesn’t matter what values are set beyond the returned length. Clarification: Confused why the returned value is an integer but your answer is an array?Note that the input array is passed in by reference, which means modification to the input array will be known to the caller as well.Internally you can think of this: // nums is passed in by reference. (i.e., without making a copy) int len = removeDuplicates(nums); // any modification to nums in your function would be known by the caller. // using the length returned by your function, it prints the first len elements. for (int i = 0; i &lt; len; i++) { print(nums[i]); } My solution:class Solution { public int removeDuplicates(int[] nums){ int j = 1; for(int i = 1; i &lt; nums.length; i++){ if(nums[i] != nums[i - 1]){ nums[j] = nums[i]; j++; } } return j; } } Question 27: Remove ElementGiven an array nums and a value val, remove all instances of that value in-place and return the new length.Do not allocate extra space for another array, you must do this by modifying the input array in-place with O(1) extra memory. The order of elements can be changed. It doesn’t matter what you leave beyond the new length. Example 1:Given nums = [3,2,2,3], val = 3, Your function should return length = 2, with the first two elements of nums being 2. It doesn’t matter what you leave beyond the returned length. Example 2:Given nums = [0,1,2,2,3,0,4,2], val = 2, Your function should return length = 5, with the first five elements of nums containing 0, 1, 3, 0, and 4. Note that the order of those five elements can be arbitrary.It doesn’t matter what values are set beyond the returned length. My solutionclass Solution { public int removeElement(int[] nums, int val) { if(nums == null || nums.length == 0) return -1; int j = 0; for(int i = 0; i &lt; nums.length; i++){ if(nums[i] != val){ nums[j] = nums[i]; j++; } } return j; } } Idea is pretty similar to the previous one. Add some possible error checking. Runtime: 4ms. (100.00%) Question 28: Implement strStr()Implement strStr(). Return the index of the first occurrence of needle in haystack, or -1 if needle is not part of haystack. Example 1: Input: haystack = “hello”, needle = “ll” Output: 2 Example 2: Input: haystack = “aaaaa”, needle = “bba” Output: -1 Clarification:What should we return when needle is an empty string? This is a great question to ask during an interview.For the purpose of this problem, we will return 0 when needle is an empty string. This is consistent to C’s strstr() and Java’s indexOf(). My solution (First Submission)class Solution { public int strStr(String haystack, String needle) { if(needle.isEmpty() || needle == null) return 0; if(haystack.contains(needle)){ for(int i = 0; i &lt; haystack.length(); i++){ if(haystack.charAt(i) == needle.charAt(0)) if(haystack.substring(i, i + needle.length()).equals(needle)) return i; } } return -1; } } Summary (Problem) Write wrong variable name. Always try to use hayStack instead of haystack, which is not correct. The last line, return -1, seems redundant. Use contains() here, which might not be right. Not quite sure whether I need to check for null here. :D Not quite sure about the use of substring as well. TO ACCESS STRING LENGTH: USE LENGTH()!!! Second submissionclass Solution { public int strStr(String haystack, String needle) { if(needle.isEmpty())// or use needle.length() == 0 here return 0; //another solution that is possible int needleLength = needle.length(); int stackLength = haystack.length(); if(stackLength &lt; needleLength) return -1; //set a point/also avoid index out of bound int BP = stackLength - needleLength; for(int i = 0; i &lt;= BP; i++){ //if(haystack.charAt(i) == needle.charAt(0)) if(haystack.substring(i, i + needleLength).equals(needle)) return i; } return -1; // if occurrence is not found } } Question 35: Search Insert PositionGiven a sorted array and a target value, return the index if the target is found. If not, return the index where it would be if it were inserted in order. You may assume no duplicates in the array. Example 1: Input: [1,3,5,6], 5 Output: 2 Example 2: Input: [1,3,5,6], 2 Output: 1 Example 3: Input: [1,3,5,6], 7 Output: 4 Example 4: Input: [1,3,5,6], 0 Output: 0 My solutionApproach: Binary Search I just learnt (but not quite familiar with) Iterate through the array. I provide two different methods below… TODO: revise the codes style appearing online upload more leetcode submissions (which I really don’t have time to pack them up together) upload some other online courses learning notes","categories":[],"tags":[{"name":"leetcode","slug":"leetcode","permalink":"http://yoursite.com/tags/leetcode/"}]},{"title":"Linear Algebra Learning Notes","slug":"Linear-Algebra-Learning-Notes","date":"2018-06-06T06:30:59.000Z","updated":"2018-10-31T23:54:07.055Z","comments":true,"path":"2018/06/06/Linear-Algebra-Learning-Notes/","link":"","permalink":"http://yoursite.com/2018/06/06/Linear-Algebra-Learning-Notes/","excerpt":"Brief notes of MIT open course Linear Algebra. Learning Period: June 6th to June 21st(2018).","text":"Brief notes of MIT open course Linear Algebra. Learning Period: June 6th to June 21st(2018). Learning Materials:MITOpenCourseWare Planning Learnning days:15days","categories":[],"tags":[{"name":"math","slug":"math","permalink":"http://yoursite.com/tags/math/"},{"name":"linear algebra","slug":"linear-algebra","permalink":"http://yoursite.com/tags/linear-algebra/"}]},{"title":"Creating Personal Blog Using Github + Hexo","slug":"Creating-Personal-Blog-Using-Github-Hexo","date":"2018-06-06T00:02:34.000Z","updated":"2018-10-31T23:57:44.817Z","comments":true,"path":"2018/06/05/Creating-Personal-Blog-Using-Github-Hexo/","link":"","permalink":"http://yoursite.com/2018/06/05/Creating-Personal-Blog-Using-Github-Hexo/","excerpt":"A brief guideline of creating a personal website. This guideline includes the solutions to some common errors.","text":"A brief guideline of creating a personal website. This guideline includes the solutions to some common errors. IntroThis is my first blog :) In this article, I will record my process of creating a personal blogusing Github and Hexo. This approach could be used to create any websites, not just blog. I will also discuss about some problems I met with and the solutions I used during this process, which might be helpful for somebody who visits this website. Hope you enjoy the charm of creation. Outline Github Hexo (Node.js, Git) Website Creation Markdown Website Optimization Github Github Pages is a static site hosting service designed to host your personal, organization, or project pages directly from a Github repository. If you don’t have a Github account, create one here! HexoWhat is Hexo? Hexo is a fast, simple and powerful blog framework; it’s also a static site generator. Click hexo website to get more information. InstallationWe’ll use Hexo to help us create our personal website. Click here to watch the video. Or you could just follow the steps below. We need to install a couple of things first. 1. Install Node.jsClick DownLoad_Nodejs to download Node.js. Or choose one of the links below. Windows Installer 32-bit Windows Installer 64-bit 2. Install GitClick git to download. Mac: See instruction in the hexo website. Webstie Optimization1. Add Favicon to Hexo Blog It depends on theme you&amp;lsquore using. Check theme documentation and the source. Here, I would like to introduce the way to change Favicon under the nexT theme. (note: Favicon means the website icon) The size of favicon could be 16x16, or 32x32. You could download the icon from any websites you like. There’re many websites that provide cute icons, such as fasticon, easyicon and so on. Notice, the picture must be the right size. Or you could use this Favicon Generator to convert your images into an icon favicon.ico. If you didn’t use the website above, please remember to change the name of your image to “favicon.ico”. Then, put this icon in /themes/next/source/images. Revise the file _config.yml inside the themes/next folder, as shown in the picture below. Notice: some problems I met with -&gt; it often takes a long time to change the website favicon, so just be patient and wait. 2. Text AlignmentProblem: It’s very weird when I type &#39; this; there’re a lot of spaces between two letters. It might be some problems with the text alignment. ..To be continue..","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/tags/hexo/"},{"name":"github","slug":"github","permalink":"http://yoursite.com/tags/github/"}]}]}